// src/data/subjects.js

export const SUBJECTS_BY_GRADE_AND_CLASS = {
    "Α' Γυμνασίου": {
        "default": ["Νέα ελληνική γλώσσα", "Αρχαία", "Μαθηματικά", "Φυσική", "Χημεία", "Βιολογία", "Ιστορία", "Γεωγραφία", "Θρησκευτικά", "Αγγλικά", "Γαλλικά/Γερμανικά", "Πληροφορική", "Καλλιτεχνικά", "Μουσική", "Φυσική Αγωγή"]
    },
    "Β' Γυμνασίου": {
        "default": ["Νέα ελληνική γλώσσα", "Αρχαία", "Μαθηματικά", "Φυσική", "Χημεία", "Βιολογία", "Ιστορία", "Γεωγραφία", "Θρησκευτικά", "Αγγλικά", "Γαλλικά/Γερμανικά", "Πληροφορική", "Καλλιτεχνικά", "Μουσική", "Φυσική Αγωγή"]
    },
    "Γ' Γυμνασίου": {
        "default": ["Νέα ελληνική γλώσσα", "Αρχαία", "Μαθηματικά", "Φυσική", "Χημεία", "Βιολογία", "Ιστορία", "Κοινωνική και Πολιτική Αγωγή", "Θρησκευτικά", "Αγγλικά", "Γαλλικά/Γερμανικά", "Πληροφορική", "Καλλιτεχνικά", "Μουσική", "Φυσική Αγωγή"]
    },
    "Α' Λυκείου": {
        "default": ["Νέα ελληνική γλώσσα", "Αρχαία", "Μαθηματικά", "Φυσική", "Χημεία", "Βιολογία", "Ιστορία", "Θρησκευτικά", "Αγγλικά", "Γαλλικά/Γερμανικά", "Πληροφορική", "Φυσική Αγωγή"]
    },
    "Β' Λυκείου": {
        "Ανθρωπιστικών": ["Νέα ελληνική γλώσσα", "Αρχαία Ελληνικά", "Ιστορία", "Λατινικά", "Φιλοσοφία", "Κοινωνιολογία", "Πολιτική Παιδεία", "Αγγλικά", "Γαλλικά/Γερμανικά"],
        "Θετικών": ["Νέα ελληνική γλώσσα", "Μαθηματικά κατεύθυνσης", "Φυσική", "Χημεία", "Βιολογία", "Πληροφορική", "Αγγλικά", "Γαλλικά/Γερμανικά"]
    },
    "Γ' Λυκείου": {
        "Ανθρωπιστικών": ["Νέα ελληνική γλώσσα", "Αρχαία Ελληνικά", "Ιστορία", "Λατινικά", "Φιλοσοφία", "Κοινωνιολογία"],
        "Θετικών": ["Νέα ελληνική γλώσσα", "Μαθηματικά κατεύθυνσης", "Φυσική", "Χημεία", "Βιολογία"],
        "Οικονομίας & Πληροφορικής": ["Νέα ελληνική γλώσσα", "Μαθηματικά κατεύθυνσης", "Αρχές Οικονομικής Θεωρίας", "Πληροφορική"]
    },
    "Γ' ΕΠΑ.Λ.": {
        "default": ["Μαθηματικά κατεύθυνσης", "Νέα Ελληνικά", "Φυσική", "Χημεία", "Πληροφορική", "Αγγλικά", "Ειδικότητα"]
    }
};

export const getSubjects = (grade, specialization) => {
    const gradeData = SUBJECTS_BY_GRADE_AND_CLASS[grade];
    if (!gradeData) {
        return [];
    }
    if (specialization && gradeData[specialization]) {
        return gradeData[specialization];
    }
    return gradeData.default || [];
};

export const getSpecializations = (grade) => {
    const gradeData = SUBJECTS_BY_GRADE_AND_CLASS[grade];
    if (!gradeData || gradeData.default) {
        return [];
    }
    return Object.keys(gradeData);
};
